#   - Выведите на экран одно значение по существующему ключу, одно по отсутствующему из словаря my_dict без ошибки.
#   - Добавьте ещё две произвольные пары того же формата в словарь my_dict.
#  - Удалите одну из пар в словаре по существующему ключу из словаря my_dict и выведите значение из этой пары на экран.
#   - Выведите на экран словарь my_dict.
#
# 3. Работа с множествами:
#   - Создайте переменную my_set и присвойте ей множество, состоящее из разных типов данных с повторяющимися значениями.
#   - Выведите на экран множество my_set (должны отобразиться только уникальные значения).
#   - Добавьте 2 произвольных элемента в множество my_set, которых ещё нет.
#   - Удалите один любой элемент из множества my_set.
#   - Выведите на экран измененное множество my_set.
my_dict = {"john": 2001, "Anna": 1998, "Mike": 2003}
print(my_dict)
print(my_dict["Anna"])
my_dict["Nikolay"]= 1999
print(my_dict["Nikolay"])
my_dict.update({"Peter": 2010, "Olga": 2000})
print(my_dict)
del my_dict["Mike"]
print(my_dict.get("Mike"))
print(my_dict)
my_set = {1, 2, 1, 2, 3, "pen", "pencil", "table", (4, 17, 3, 11)}
print(my_set)
my_set.update({555, "orange"})
my_set.remove("pen")
print(my_set)
