#  Организуйте программу:
#
#     Создайте переменную my_string и присвойте ей значение строки с произвольным текстом (функция input()).
#     Вывести количество символов введённого текста
my_string = input("Напишите любое словосочетание: ")
print(len(my_string))
print(my_string.upper())
print(my_string.lower())
print(my_string.replace(' ',''))
print(my_string[0])
print(my_string[-1])
